#+latex_class: fei
#+options: author:nil
#+title: /Threading/ e /Speedup/, um estudo simples
#+latex_header: \author{{Leon Ferreira Bellini} \\ {\small 22.218.002-8} \and Guilherme Ormond Sampaio \\ {\small 22.218.007-7}}
#+property: header-args :eval no-export
** Entrada

O executável tratará de certas /flags/ as quais o auxiliam distinguir entre a execução por meio do /wrapper/ ou por um usuário comum. Tal entrada tem o seguinte formato:


~./Primos --output=<0 (apenas tempo) ou 1(tempo + resultado)> \ --qt-threads=<0 ate n>~


Logo, se o usuário deseja um comportamento /single-threaded/, basta invocar o executável com os seguintes parâmetros:

#+begin_src sh :exports both
./Primos --output=1 --qt-threads=1
#+end_src

#+RESULTS:
| 6604.2 |
| 121300 |

Onde a primeira linha trata-se do tempo em *milissegundos* e a segunda a quantidade de números primos encontrados dentre a base carregada. 

** Coletando os dados das execuções

Alguns fatores devem ser, primeiramente, expostos a fim de tornar este experimento o mais transparente possível. 

1. O experimento será executado numa CPU *quad-core*, ou seja, num melhor caso quatro /threads/ do programa ocuparão as CPUs antes de uma troca de contexto. Não há garantia que o aumento de /threads/ com \(n > 4\) aumente as chances do programa estar em uma das CPUs.
2. Como maneira de se autopreservar, sistemas diminuem as frequências de suas CPUs como forma de diminuir a temperatura para um valor que não seja danoso. Logo, alguns valores podem se apresentar como maiores do que deveriam nas iterações mais avançadas. 


O grupo definiu *dez threads* como limite, gerando  \(50 \times 10\) execuções.

#+begin_src lisp
(defparameter *thread-count* 10)
#+end_src

#+RESULTS:
: *THREAD-COUNT*

Após terminação, será produzida uma tabela cujas colunas representam:

1. Número de /threads n/
2. Tempo em milissegundos da execução
3. /Speedup/


As linhas sendo produzidas pela seguinte função:

#+begin_src lisp
(defun get-row (n &key serial)
  "Returns a single row of our table.
Having the number of threads to execute the main program being ``n'',
this procedure will return a list with the following structure:

(number-of-threads (average-time . speedup))

The optional keyword argument, ``serial'' tells us that the serial time was
supplied, otherwise the average time will be divided by itself in order to
obtain speedup info"
  (let* ((time (get-average *total-runs* n))
	 (speedup (get-speedup (or serial time) time)))
    (list n time speedup)))
#+end_src

#+RESULTS:
: GET-ROW

#+latex: \clearpage

E por fim, a função "principal".

#+begin_src lisp
(defun produce-table ()
  "Produces the main table to be read by org."
  (let* ((serial-row (get-row 1))
	 (serial-time (second serial-row))
	 (parallel-table (loop for n from 2 to *thread-count*
			       collect (get-row n :serial serial-time ))))
    (cons serial-row parallel-table)))
#+end_src

#+RESULTS:
: PRODUCE-TABLE

Após duas horas de execução, foram obtidos os seguintes resultados:

#+begin_src lisp :exports both
(produce-table)
#+end_src

#+RESULTS:
#+PLOT: set:"xlabel 'Threads'" set:"ylabel 'Tempo médio (ms)'" set:"xtics 1"
#+PLOT: title:"Speedup com paralelismo" ind:1 :deps(2 3) type:2d with:lines
#+PLOT: labels:("New label" "Speedup" "")
#+PLOT: set:"output './speedup-graph.png'" set:"terminal png size 600,300"
| / |       < |                < |        <> |
|---+---------+------------------+-----------|
|   | Threads | Tempo médio (ms) |   Speedup |
|---+---------+------------------+-----------|
|   |       1 |          5831.78 |       1.0 |
|   |       2 |        3496.3193 | 1.6679769 |
|   |       3 |        3483.8306 | 1.6739562 |
|   |       4 |        3004.3293 | 1.9411253 |
|   |       5 |        2950.7893 | 1.9763457 |
|   |       6 |        2926.4277 | 1.9927982 |
|   |       7 |        2885.4094 | 2.0211272 |
|   |       8 |        2855.3257 | 2.0424218 |
|   |       9 |        2849.0715 | 2.0469053 |
|   |      10 |        2839.9644 | 2.0534694 |
|---+---------+------------------+-----------|


